app/controllers/tasks_controller.rb

  def index
    #@tasks = current_user.tasks  # list all tasks regardless of state
    @to_do = current_user.tasks.where(state: "to_do")
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."state" = ?  [["user_id", 1], ["state", "to_do"]]

  def create
    @task = current_user.tasks.new(task_params)
    @task.save
---
INSERT INTO "tasks" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test task"], ["user_id", 1], ["created_at", "2015-04-17 01:50:22.188526"], ["updated_at", "2015-04-17 01:50:22.188526"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "content" = ?, "content_html" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["content", "test efdf"], ["content_html", "<p>test efdf</p>"], ["updated_at", "2015-04-23 23:41:43.649788"], ["id", 15]]

  def change
    @task.update_attributes(state: params[:state])
---
UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "doing"], ["updated_at", "2015-04-16 20:50:55.329096"], ["id", 2]]